Revit 2027 API
IFCFile.Write Method
 Writes content to a file of IFC format.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Write(
	IFCFileWriteOptions writeOptions
)
Public Sub Write (
	writeOptions As IFCFileWriteOptions
)
public:
void Write(
	IFCFileWriteOptions^ writeOptions
)
member Write :
        writeOptions : IFCFileWriteOptions -> unit
Parameters
writeOptions IFCFileWriteOptions
 The IFC file write options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace